In [1]:
import pandas as pd
import numpy as np
from sklearn.preprocessing import LabelEncoder, OneHotEncoder
from sklearn import preprocessing
import statsmodels as sm

df = pd.DataFrame([["India", 44, 72000],
                   ["US", 34, 65000],
                   ["Japan", 46, 98000],
                  ["US", 35, 45000],
                  ["Japan", 23, 34000]],
                  columns=["Country", "Age", "Salary"])

In [2]:
cat_columns = ["Country"]

In [3]:
df_processed = pd.get_dummies(df, prefix_sep="__",columns=cat_columns)

In [4]:
df_processed

   Age  Salary  Country__India  Country__Japan  Country__US
0   44   72000               1               0            0
1   34   65000               0               0            1
2   46   98000               0               1            0
3   35   45000               0               0            1
4   23   34000               0               1            0

In [26]:
cat_columns

['city', 'transport']

In [28]:
df_processed.head()

,duration,city__Cambridge,city__Liverpool,city__London,transport__bus,transport__car
0,20,0,0,1,0,1
1,10,1,0,0,0,1
2,30,0,1,0,1,0

In [32]:
cat_dummies = [col for col in df_processed 
               if "__" in col 
               and col.split("__")[0] in cat_columns]

In [33]:
processed_columns = list(df_processed.columns[:])

In [34]:
processed_columns

['duration',
 'city__Cambridge',
 'city__Liverpool',
 'city__London',
 'transport__bus',
 'transport__car']

In [35]:
df_test_processed = pd.get_dummies(df_test, prefix_sep="__", 
                                   columns=cat_columns)

In [36]:
df_test_processed.head()

,duration,city__Cambridge,city__Liverpool,city__Manchester,transport__bike,transport__car
0,30,0,0,1,1,0
1,50,1,0,0,0,1
2,10,0,1,0,1,0

In [39]:
df_dummies= pd.get_dummies(df, prefix='cityname', columns=['city']) #This function does One-Hot-Encoding on categorical text

In [41]:
df_dummies

  transport  duration  cityname_Cambridge  cityname_Liverpool  cityname_London
0       car        20                   0                   0                1
1       car        10                   1                   0                0
2       bus        30                   0                   1                0

In [45]:
from sklearn.preprocessing import LabelEncoder   # import label encoder

labelencoder = LabelEncoder()  

df_dummies['trans'] = labelencoder.fit_transform(df_dummies.transport) # returns label encoded variable(s)

In [46]:
df_dummies.head()

,transport,duration,cityname_Cambridge,cityname_Liverpool,cityname_London,CityNames,trans
0,car,20,0,0,1,1,1
1,car,10,1,0,0,1,1
2,bus,30,0,1,0,0,0

In [47]:
from sklearn.preprocessing import OneHotEncoder
hotencoder = OneHotEncoder()
encoded = hotencoder.fit_transform(df_dummies.trans.values.reshape(-1,1)).toarray() 
# Returns a numpy array of one hot encoded variables
encoded

array([[0., 1.],
       [0., 1.],
       [1., 0.]])

In [50]:
encoded.shape

(3, 2)

In [51]:
# convert the array into a dataframe. Specifically, one hot encoded dataframe

df_encoded = pd.DataFrame(encoded, columns = ["trans_"+str(int(i)) for i in range(encoded.shape[1])])

In [52]:
df_encoded.head()

   trans_0  trans_1
0      0.0      1.0
1      0.0      1.0
2      1.0      0.0

In [53]:
df_dummies = pd.concat([df_dummies, df_encoded], axis=1)  # concats two dataframes

In [54]:
df_dummies.head()

,transport,duration,cityname_Cambridge,cityname_Liverpool,cityname_London,CityNames,trans,trans_0,trans_1
0,car,20,0,0,1,1,1,0.0,1.0
1,car,10,1,0,0,1,1,0.0,1.0
2,bus,30,0,1,0,0,0,1.0,0.0